[
  {
    "reviewerID": "A35947ZP82G7JH",
    "asin": "0005019281",
    "reviewerName": "Amarah Strack",
    "helpful": [
      0,
      0
    ],
    "reviewText": "It was good but not as emotionally moving as the the Christmas Carol by Dickens  I like Christmas movies that make me sigh",
    "overall": 3.0,
    "summary": "Good but not as moving",
    "unixReviewTime": 1388361600,
    "reviewTime": "12 30, 2013",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A3UORV8A9D5L2E",
    "asin": "0005019281",
    "reviewerName": "Amazon Customer",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Don't get me wrong, Winkler is a wonderful character actor and I would rate 95% of his performances as B+ or A, however, he was not very convincing in the starring role of &#34;An American Christmas Carol.&#34;  I'd give it a C or C+ at best.  Ayyyyy!",
    "overall": 3.0,
    "summary": "Winkler's Performance was ok at best!",
    "unixReviewTime": 1388361600,
    "reviewTime": "12 30, 2013",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A1VKW06X1O2X7V",
    "asin": "0005019281",
    "reviewerName": "Amazon Customer \"Softmill\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Henry Winkler is very good in this twist on the classic story. Not a conventional remake, but a version of the story set in early America. Give it a try.",
    "overall": 5.0,
    "summary": "It's an enjoyable twist on the classic story",
    "unixReviewTime": 1202860800,
    "reviewTime": "02 13, 2008",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3R27T4HADWFFJ",
    "asin": "0005019281",
    "reviewerName": "BABE",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This is one of the best Scrooge movies out.  Henry Winkler outdoes himself.  The casting is excellent and the music and theme old but very relevant.",
    "overall": 4.0,
    "summary": "Best Scrooge yet",
    "unixReviewTime": 1387670400,
    "reviewTime": "12 22, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2L0G56BNOTX6S",
    "asin": "0005019281",
    "reviewerName": "barbara whapeles",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This has been a favorite movie of mine for a long time.  Henry winkler is great as a modern day Scrooge.  There are many movies giving a new twist to Dickens, but this one is true to the original story.  It is set during the depression.",
    "overall": 5.0,
    "summary": "Dickens updated.",
    "unixReviewTime": 1383696000,
    "reviewTime": "11 6, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A5NYUBEKXFLX5",
    "asin": "0005019281",
    "reviewerName": "B. Babb \"kites0852\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "This is the American adaptation of the Charles Dickens' classic.  It is interesting that in the movie the main character is seen ripping the pages out of a collector's item book of \"A Christmas Carol.\"Henry Winkler gives an outstanding performance as Benedict Slade, a loan officer who reclaims valued possessions of those unable to make late payments on Christmas Eve.His visit by the spirits, the life in the orphanage and how one man helped him, leads to a very sentimental ending.It would have been good if the images could be enhanced for better viewing.  This originally was a 'made-for-TV' program and is presented complete with the fade-outs for the commercial breaks.David Wayne gives a great performance as the book owner as well as Christmases past.",
    "overall": 5.0,
    "summary": "A MUST-HAVE FOR ANY VIDEO CHRISTMAS COLLECTION!!",
    "unixReviewTime": 1230595200,
    "reviewTime": "12 30, 2008",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2DJ8B8GE4V2VD",
    "asin": "0005019281",
    "reviewerName": "Berl S. Meyer",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Glad that this american classic came out on dvd.  I have been waiting for it for a long time.  I haven't seen this production since it came out years ago.  Plus it's better than some Hallmark holiday movies.",
    "overall": 5.0,
    "summary": "An American Christmas Carol",
    "unixReviewTime": 1260835200,
    "reviewTime": "12 15, 2009",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AWF2S3UNW9UA0",
    "asin": "0005019281",
    "reviewerName": "beth holman",
    "helpful": [
      0,
      0
    ],
    "reviewText": "A good Christmas carol dhenry winkler one during the depression. Henry winkler does a good job.a classic film I recommend for all ages.",
    "overall": 5.0,
    "summary": "an american christmas carol",
    "unixReviewTime": 1386201600,
    "reviewTime": "12 5, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3O4UUT83DG3OU",
    "asin": "0005019281",
    "reviewerName": "Bettylou Sperling",
    "helpful": [
      0,
      0
    ],
    "reviewText": "How a bitter old man comes to know the true meaning of Christmas. Realizing to late his lost love and life.",
    "overall": 5.0,
    "summary": "Fantastic!",
    "unixReviewTime": 1379721600,
    "reviewTime": "09 21, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3TK5Q142X5Q8A",
    "asin": "0005019281",
    "reviewerName": "BluegrassGirl \"Mother Nature\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The small historic Canadian town of Elora, with its many century-old buildings, is the perfect setting for this story, set in the early 1900's.  Bringing the story to 20th century America allows the story to incorporate situations Americans can more easily with.  Henry Winkler does a great job of recreating the Scrooge character, and the supporting cast are no less admirable.  This is an annual &#34;must watch&#34; story for me.",
    "overall": 5.0,
    "summary": "Outstanding Concept, and Performances",
    "unixReviewTime": 1387497600,
    "reviewTime": "12 20, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A33EWPXESP9GQH",
    "asin": "0005019281",
    "reviewerName": "Buckaroo \"Dead Dog\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Even though i don't care for Henry Winklers  acting i liked this movie it fit him real good ThanksDale",
    "overall": 5.0,
    "summary": "Good Version",
    "unixReviewTime": 1390780800,
    "reviewTime": "01 27, 2014",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AG8D804FUG5Y4",
    "asin": "0005019281",
    "reviewerName": "Bud Harris \"Bud 101\"",
    "helpful": [
      0,
      1
    ],
    "reviewText": "My wife told me of this movie in which Henry Winkler stars & shows he can act in this different version of a Chrismas Carol.",
    "overall": 3.0,
    "summary": "Christmas",
    "unixReviewTime": 1199836800,
    "reviewTime": "01 9, 2008",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1GHUN5HXMHZ89",
    "asin": "0005019281",
    "reviewerName": "C. A. Luster \"The Rook\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The first time I saw &#34;An American Christmas Carol&#34; I immediately fell in love with it.  I didn't grow up during the Great Depression but my father did and he told stories that made it real for me.  This re-imagination of an Americanized Scrooge during the Depression is wonderful.  The story, acting, directing, camera work, costumes, sets, locations, music, and all production values are great.  I have always enjoyed Henry Winkler as an actor, but I think this is by far one of his best if not the best performance of his career to date.  I highly recommend it for the whole family.CA Luster",
    "overall": 5.0,
    "summary": "An American Christmas Carol",
    "unixReviewTime": 1387670400,
    "reviewTime": "12 22, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A30TK6U7DNS82R",
    "asin": "0767808460",
    "reviewerName": "Kevin Killian",
    "helpful": [
      1,
      3
    ],
    "reviewText": "Juliette Greco is perfection as the aging nightclub singer at a chic Paris boite, who sings to strangers night after night of a \"street with no address.\"  Irretrievably ravaged by time and perfidious love, Greco gives the part nearly everything she has; in her excellent Givenchy gown she bespeaks chic even as she allows emotion to tremble through her quack of a voice.  As she sings the haunting title track, Jean Seberg is twirling around on the dancefloor simultaneously drinking Greco in and obsessing about her own memories of a colorful, blue-splashed summer on the French Riviera, the summer in which the mystic numbers \"7\" and \"e\" combined to form a summer of death and disaster.Preminger is superbly understated here, his direction of Seberg assured and yet improvisatory.  Some have criticized the way that Seberg, Niven, and Kerr never even try to sound like French people, and some say that the heavily accented English of the fourth lead, Mylene Demongeot, sounds like gobbledegook and makes her co-stars seem even flatter.  None of them is actually convincing, and Niven and Kerr are oddly miscast, but all of them are great in their own lights.  Kerr is believable as a dress designer, Niven sort of believable as a girl's best friend kind of dad, though neither of them seem sexy enough for their parts.  Maybe in real life David Niven was some sort of super playboy but I'm just not feeling it here.  Why didn't they just hire Jimmy Stewart if they wanted a palsy kind of older actor to be Seberg's father?  She seems like she's in love with him, or does she just feel responsible for his happiness since the mother's death?  I kept waiting for the other shoe to drop and to discover that she had \"accidentally\" killed the mother, but we never get that story, maybe in the sequel?What's great about the movie--beyond the main cast?  Saul Bass' title design has got to be among his very best: the pattern of gold coins and crosses moving along a black screen like stars in the night sky, gradually being supplanted by red hearts and blue waves, and finally resolving themselves into the famous line drawing of Juliette Greco's crying face--OMG, you will feel like you've died and woken up in France.Geoffrey Horne as the boy next door, especially the scene where Cecile musters up all her courage and runs to his house, skips through the hallways like a thing possessed, and then pauses outside a door.  She throws open the door and you see a dimly lit room and Geoffrey Horne asleep, face down, on a single bed, the whole room lit up by the eerie, glowing white of his incredibly revealing underwear.  Va va voom, no wonder she jumps on that law student!Also the color design of the film, how the present is in black and white, but the flashbacks in color.  The first, Juliette Greco scene,is especially impressive in this regard as Seberg, haunted by the past, is glimpsed dancing over the shoulder of her partner, until shards of color (blue) bombard her in triangles stripped into the negative (I guess) that finally overwhelm her and propel the film directly into the past,  Must be taken from those Jazz cut-outs of Matisse; this sequence is a direct ancestor of Kylie Minogue's Riviera-like videos for \"Slow\" and \"On a Night Like This.\"  In fact the Kylie-Rutger Hauer relationship in the \"On a Night Like This\" clip definitely smacks of the Seberg-Niven one here in BT.  Maybe I'm overthinking this.",
    "overall": 5.0,
    "summary": "My Kiss Has No Caress",
    "unixReviewTime": 1222646400,
    "reviewTime": "09 29, 2008",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1PICWXVZHP61T",
    "asin": "0767808460",
    "reviewerName": "Maeve of Tara \"Avid Reader\"",
    "helpful": [
      22,
      24
    ],
    "reviewText": "I read the novel well over thirty years ago, in Europe, when I was fifteen, but did not get to watch the movie until tonight. I wanted to see it for a sit-down stroll through memory lane, and never expected to be touched by the story and its morale. You see, when I first read the novel, I did not care about it; I was then a fifteen-year old who was dealing with a much harsher existence than the seventeen-year old Cecile's (marvelously portrayed by Jean Seberg), who had the freedom and the money to drive her own car, to smoke, to dance, and hobnob between Paris and the French Riviera with her soft-hearted, caring, and still a child-at-heart, dad. Thus her poor little rich girl's woes, primarily consisting of keeping her dad's love to herself, was boring as well as infuriating. I realize now that I got to read the novel again to reexperience the characters in the manner originally presented by Francoise Sagan.From the film version I watched tonight, I did not get the sense that it's >>>an accurate account of the empty, amoral, flamboyant and insensitive life in the French \"high-life\" during the late 50's/early 60's.&lt;&lt;&lt;&lt;The core of the story is a father (debonair David Niven) and teenage daughter (beautiful imp, Jean Seberg), who lead charming lives and have the good fortune of being each other's friend and confidante. I can't recall a reference as to the manner of the mother's death (re-reading the novel ought to help in that), but neither the father nor the daughter seem to mourn her loss. However one may easily surmise that the father's affectionate and  tolerant treatment of his daughter is his way of filling the void of a mother in her life. Although a charming and prolific playboy, he always makes sure that his daughter knows she is number one in his heart, and Cecile never feels threatened by any of his short-lived paramours.So, on that fateful summer, father and daughter land on the French Riviera for their customary fun-filled R & R. But then a dark cloud appears on Cecile's sunny skies: Anne (portrayed by Deborah Kerr), beautiful, intelligent, elegant, a successful career woman willing to leave her profession (she is a respected fashion designer) to be a perfect wife and astute stepmother; much to Cecile's chagrin her father falls for Anne's charms, pops the question and Anne answers in the affirmative. Overcome by jealousy and the fear of losing her careless butterfly lifestyle, Cecile hatches a diabolic plot to prevent their marriage from occurring. And unfortunately, she succeeds, with tragic consequences.The morale, of course, is: don't mess with Fate! On the other hand, Cecile, having faced her darker side, builds a wall around her heart to keep herself from feeling pain and sorrow, yet as you watch the closing scene, you will understand that the wall is transparent, letting us look into Cecile's soul as she sits in front of her mirror, taking off her make-up with cream, and by now the scene has reverted to black/silver/white...tears are running down her cheeks... and, ah, tristesse.... bonjur, and bonnuit, always.The cinematography is superb, the opening and closing scenes are various shades of gray and silver, and then as the story flashes back the French Riviera comes alive in glorious colors, Jean Seberg is just beautiful,her portrayal of Cecile deserving of respect, David Niven sophisticated in an easy-going, warm-hearted way, Deborah Kerr's Anne is perfection, and Juliette Greco, playing herself as the night club singer crooning Bonjour Tristesse in her unique style, a real treat. Be prepared to be surprised at how much you will feel touched, and enjoy.PS: French author Francoise Sagan, had made international headlines when she was a teenager with her first novel, \"Bonjour Tristesse\". Her background was privileged, a la her heroine, Cecile's; born Francoise Quoirez to a wealthy family in Cajarc in southwestern France, Sagan - who took her pseudonym from a character in Marcel Proust's \"Remembrance of Things Past\" - was educated in private and convent schools at home and in Switzerland. She wrote \"Bonjour Tristesse\" (\"Hello Sadness\") in 1953 while on a summer holiday from her studies at the Sorbonne. Sagan, then 18, completed the manuscript in just six weeks.Interesting to note how the world has changed, since then... upon its release in 1954, Bonjour Tristesse created a furor in France. Some critics scorned it as a tale of \"passionless hedonism\" and Sagan was called immoral and was marked as symbolizing a generation of bored and blas&eacute; young adults. They could not have been more wrong....",
    "overall": 5.0,
    "summary": "Charming story with a good twist in the end",
    "unixReviewTime": 1104969600,
    "reviewTime": "01 6, 2005",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A3QFC8X23IR3QC",
    "asin": "0767808460",
    "reviewerName": "Michael C. Smith \"MGMboy@aol.com\"",
    "helpful": [
      40,
      42
    ],
    "reviewText": "This stylish film is one of Otto Preminger's best. The French New Wave has influenced him in his opening shots, but only on a visual level. This is pure Hollywood on ever other level.  The melding of the two styles works perfectly and begins by setting  the stark mood in stunning black and white widescreen shots of 1958 Paris. The present is painted in shades of grey and silver, where Cecile portrayed by the beautiful Jean Seaberg moves aimlessly thought her pointless upper crust Parisian life. Only when she encounters her father David Niven later in the evening does the past seep in on the edges of the cinemascope frame in vivid color and finally takes over moving us from the present to last summer on the Riviera. The device is used several times as we move from past to present and finally at the end of the film it creates a stunning effect once you know what suddenly happed to Cecile and her father last summer. The thing that changed everything forever and allows Preminger's camera to linger in the last frame of the film on Jean Seaberg as she wipes away the make-up from her perfect face.David Niven is perfectly cast as Raymond the aging (...) father of Cecile. He has the cool style and humor of a man who can't commit to any woman and treats his daughter like a playmate rather than his child. His particular talents as an actor are that he seems to be playing the  \"David Niven\" character in most of his films but here in `Bonjour' as he often does in so many roles he makes a nice little twist on the \"character\". He catches you off guard to wrench his and the audiences emotions and prove once again what a good actor he is.At first Deborah Kerr also seems to be playing her role by rote but it is just a ruse to set us up for her fall.  As does Niven she too digs deeper in to her persona as Anne Larson and carries the film to its surprise ending.  She is a joy to watch as a film actress and here she is particularly wonderful.The French actress Mylene Demongeout is delightful as Elsa, Ramon's summer plaything. She is in fact `Brilliant!\" in the role.Geoffrey Horne is decorative and serviceable in his role as Cecile's beau who awakens her (...) .Jean Seaberg who with her short cropped spiked hair in certain shots reminded me of Sharon Stone has that kind of blonde goddess look that Miss Stone possesses. She was only 19 when she made the film and in the hands of her director she presents us with a sensitive and spellbinding performance as Cecile.  She is at once a teenager in turmoil and a young girl on the verge of becoming a woman. This is a delicate high wire act that the young Miss Seaberg executes with charm and elegance. She is festinating to watch and just right for the role.The subject matter is even today a little shocking and indeed this is one of the films of the 1950's that put the sin in Cinemascope. Despite the restrictions of the day or because of them filmmakers of that time were challenged in ways they are not today. Challenged to be inventive and insinuate things that we were too innocent or too naive to know happen in the world. Those filmmakers knew that the imagination is more vivid and titillating than what they might show.  It was good that the antiquated production code of the Hayes office crumbled in the 60's but with it's passing we lost a whole vocabulary in film. Here is a wonderful example of the meeting of the Movies and 50's cinematic innuendo that serves this delicate story to a tee. I think \"Bonjour Tristesse\" is `Brilliant!'",
    "overall": 5.0,
    "summary": "'Brilliant!\"",
    "unixReviewTime": 1086566400,
    "reviewTime": "06 7, 2004",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1PL8JA0TEHBVN",
    "asin": "0767808460",
    "reviewerName": "Paulo Leite",
    "helpful": [
      24,
      26
    ],
    "reviewText": "This film has several elements that are worth noting. First, it is an accurate account of the empty, amoral, flamboyant and insensitive life in the French &quot;high-life&quot; during the late 50's/early 60's. Told in flashback, the story shows the way the central characters behave, have fun, hurt people and get to a point when &quot;have fun&quot; is just a way of forgetting.The whole cast is excelent. David Niven is the most perfect &quot;late life&quot; bachelor who is cool about everything. Jean Seberg is absolutely beautiful as a teenager who practically lives as a woman... the chemistry of the two characters (father and daughter) is fantastic (and very puzzling). Deborah Kerr has also a great role as a sophisticated woman who doesn't get to understand the games going on between father and daughter.The film has a beautiful cinematography. It opens in a dark black and white while all the flashback scenes are in the most fantastic colors - a perfect example how cinematography serves to enhance the character's point of view and (also) tell the story at a visual level.The final scene is something that will stay in your memory for a long time as a great example of a great conclusion for a story that is rich and well written.This film is a serious study of aloofness, emptyness and amorality in a way that only Hollywood could tell. It shows that money can buy off some consciences while, deep inside, some consiences cannot be bought.A trully great cinematic experience!!!This DVD edition has no extras (except for trailers). The image quality is first rate. So is sound quality. The opening titles (by Saul Bass, no less!) is gorgeous! The cinemascope cinematography by Georges Perinal begs to be viewd in a big screen. The music score by the great Georges Auric (&quot;Rififi&quot; and &quot;La Bele et la Bte&quot;) is top.",
    "overall": 5.0,
    "summary": "An Impressive Film in all Aspects! Why?",
    "unixReviewTime": 1079222400,
    "reviewTime": "03 14, 2004",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1EHO1C89QIBOT",
    "asin": "0767808460",
    "reviewerName": "Randy Buck",
    "helpful": [
      5,
      6
    ],
    "reviewText": "BONJOUR TRISTESSE, like many Preminger films, is ripe for reevaluation, and this spiffy new DVD transfer may help spur on that long-overdue second look.  Seberg's performance was much-maligned in its day, but she looks smashing here and acts with considerable wit and poise; our girl's a long way from Marshalltown.  True, vocally she's perhaps not ideal, but certainly sounds as Gallic as co-stars Kerr and Niven.  The material plays with all three stars' images in fascinating ways; Seberg's ingenue is lethal, Kerr, frequently neurotic, was never presented as a creature of such moral ambiguity, and Niven's all suave facade covering inner corruption, in a performance akin to his Oscar-winning turn in SEPARATE TABLES.  Wonderful location photography, and great fun to hear the title tune keep turning up in a variety of arrangements, in best 50's-movie-theme-song tradition.  The comparison others have made on this site to the glorious Sirk melodramas is apt; the picture transcends genre in many of the same ways.  Preminger and company manage to get under your skin.",
    "overall": 5.0,
    "summary": "Hello, Gorgeous!",
    "unixReviewTime": 1080691200,
    "reviewTime": "03 31, 2004",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AGZVS6M8XJGN6",
    "asin": "0767808460",
    "reviewerName": "Roberto Frangie \"Robert\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "The films of Otto Preminger share for the most part a detached objectivity in their attitudes to character and moral issues...In \"Bonjour Tristesse,\" his gamine prot&eacute;g&eacute; Cecile (Jean Seberg) is a very peculiar girl, maybe spoiled and willful and arrogant and lazy...Anne (Deborah Kerr) had made her look at herself for the first time in her life...And that turned her against her... And now, her father is not having fun anymore, which was probably another reason she decided to get rid of her... How carefully and how seriously she went about that decision, is the tale of Franoise Sagan, published in 1954, by the time she was nineteen...Raymond (David Niven) is a bundle of surprises... For him, it's such a wonderful fun to have Cecile for a daughter... And loving Anne doesn't mean that he loves his daughter any less... The wealthy playboy becomes serious from the moment that Anne arrived... He could never think of her as just someone to have fun with... He does have fun with Elsa (Myl&egrave;ne Demongeot) but that's a long way from being all he wants... Now, he has never wanted any woman the way he wants Anne...Anne spent her honeymoon by the sea 12 years ago... She had quite a debate with herself before coming down to the French Riviera... For knowing that Elsa was there, she got stupidly angry and decided to leave...Then the prospect of packing and looking for a hotel was too much after that long drive so she decided to stay...Being too sophisticated (maybe for discovering occupied territory), Anne was as suspicious of summer as she was of Raymond in spite of the fact that she knew him 15 years ago, and was quite sure that with him, nobody is safe...For Cecile, Anne is prim and prissy and prude... For a woman who hates vulgarities--even when they're funny--she could never be seriously interested in a man like her father... So part of her was angry, part was happy, all of her was excited... Her father had brought a girl to the seashore, made her go out in the sun and then when she was a mess of peeling, dropped her like a hot lobster... It was unfair... Yet even while she was angry at him, she was proud that he had gotten the unattainable Anne... Anne looks now softer... She moves easier... In the morning, she seems as though she had the most wonderful secret in the world...Suddenly she becomes aware of a great responsibility towards Cecile, as it would be good if she stops seeing Philippe (Geoffrey Horne) and studies for her philosophy examination...Cecile becomes furious at her interference... Anne wants her to study and not to see Philippe... So what shall it be? For her, there'll be a man to take care of her...And she doesn't need a diploma for that...Now she hates Anne... For her, she has changed her father...She'll change her and will change everything...",
    "overall": 3.0,
    "summary": "Another study in a teenage girl's destructive dislike for her widowed father's lover...",
    "unixReviewTime": 1232928000,
    "reviewTime": "01 26, 2009",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A3S1ZDTZQJTJVU",
    "asin": "0767808460",
    "reviewerName": "ruah albi",
    "helpful": [
      0,
      0
    ],
    "reviewText": "It is a sensitive, thought-provoking, and elegant film. Excellent actors, outstanding photography, penetrating story.  I would advise it to anyone concerned with finding the true meaning of relationships.",
    "overall": 5.0,
    "summary": "Exquisite fim",
    "unixReviewTime": 1368057600,
    "reviewTime": "05 9, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A14ADG0TTI4XBV",
    "asin": "0767808460",
    "reviewerName": "Scott Coblio \"kookoo guy\"",
    "helpful": [
      9,
      10
    ],
    "reviewText": "Panned at the time of its release, \"Bonjour Tristesse\" stands up today as one of the more stylish and less hokey 1950's treatments of teenage angst & sexuality in changing times (it's more commercial counterpart would be the saccharine \"A Summer Place\" with Sandra Dee). Shot almost entirely on location at a villa on the French Riviera, director Otto Preminger's camera often encircles it subjects, follows them straight through rooms, up stairs and around porches, until you get a panoramic sense of really being there with the characters amidst the beautiful scenery. There's a sense of perpetual movement in the camerawork that makes \"Bonjour\" worth studying for its innovative cinematography alone.Adding to the eye-candy factor is star Jean Seberg in her second film and second collaboration with Preminger (their first being the disastrous \"Saint Joan\" of the year before). Jean caught a lot of flack from skeptics who criticized her performance as \"wooden\" and \"stilted\", bedgrudging her rapid ascent to leading-lady status after having been picked from obscurity to play Joan of Arc.  Preminger's \"search for Joan\" contest was not unlike today's \"American Idol\", with the instant success (and resentment) that its \"winners\" experience. On his TV show, Mike Wallace grilled her mercilessly about whether or not she thought she deserved to star in anything, firing accusatory statements at her like \"you are a synthetic star\", \"your debut was a failure...what are you going to do if you fail again? What will it take for you to pack up your bags and go home?\"  As it happened, Jean met both Wallace's hostility and the challenges of \"Bonjour Tristesse\" with her customary good grace.As Cecile, Jean adeptly essays a teenage girl, sweet of temperament but disporportionately enamored of her widowed father, played by David Niven. Cecile plots and schemes--with disastrous results--to eliminate Anne (Deborah Kerr) as  the competition for his affections.Compelling by her looks alone--dimpled and aglow with youth (and a decidedly  lucky bone structure), Seberg nonetheless does more than just trade on her beauty--she carves something interesting from a character that could easily have been bland.  The duplicitous Cecile, who is not quite as benign as she seems, needs just the right amount of lurking menace--more the result of immaturity than evil, and Seberg manages the balance commendably. Her inexperience shows through in spots, but as Francois Truffaut remarked of her performance, \"when she is onscreen--and she is onscreen all the time--you can look at no one else.\" She had that cinematic attribute which trumps virtuosity; she is compelling. Ironically, it is in  the easy scenes that she is weak and the histrionic ones where she shines. But she is never less than arresting, never boring, never banal. She glitters with star quality.Co-stars David Niven and Deborah Kerr are excellent--Niven especially as the philandering but loveable father,  and Mylene Demengeot as Cecile's comic girlfriend contribute much toward making \"Tristesse\" a funny, sad, and haunting picture. The sexual and moral (or amoral) themes are ahead of their time, perhaps influenced by the French New Wave that was just gaining momentum (and which would embrace Seberg as its female mascot after the release of Godard's \"Breathless\").If you are in doubt of \"Bonjour\"'s ability to pack a dramatic wallop or 19 year-old Seberg's ability to render its message with depth and sensitivity--bear with it to the final shot, where Cecile, Macbeth-like, vainly tries to wash herself clean in a makeup mirror, her face a mask, betrayed only by the eyes filling slowly with tears of self-loathing for the damage she has wrought, until finally her pretty face cracks like a porcelain doll.",
    "overall": 5.0,
    "summary": "Seberg: The Haunted Pixie",
    "unixReviewTime": 1119830400,
    "reviewTime": "06 27, 2005",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1DHFQP9G5F7LY",
    "asin": "0767808460",
    "reviewerName": "Stephen C. Bird",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Seeing this film for the first time--Near its beginning I was laughing.  Initially, \"Bonjour Tristesse\" seems dated.  Cecile (Jean Seberg), is flitting from man to man diffidently (19 year old Seberg portrays a 17 year old character, going on 37).  In Chapter 4 of this DVD, we see her facing the camera, dancing with a man, as she simultaneously narrates this scene in a bitter, hollow voice.  One has to wonder \"What is wrong with this girl?  What has made her so heartless?\" The action then shifts to the French Riviera, enticingly filmed in Technicolor; ultra-bright blues and greens--Even the olive-colored tiles in the bathroom of Cecile's bathroom are stunning.  But something's off--Superstition hangs over the sunny Mediterranean like a shroud--The number 7 having particular significance in this story.  The picture gets cooking about halfway through--Things start to unravel when Anne (Deborah Kerr), the new woman of Cecile's father, Raymond (David Niven), starts to impose her morally superior will upon amoral Cecile.  Anne forbids Cecile to see Phillippe, a law student from the neighboring villa, as he will distract Cecile from studying for the philosophy exams that she has recently flunked.  Cecile becomes furious with Anne; \"Anne is prim and prissy and a prude and a know-it-all, and I hate her!\" she exclaims while sticking needles into her doll.  Cecile sets a trap involving her boyfriend Phillippe and one of her father's ex-girlfriends; Cecile calls upon \"Jealousy the Green Eyed Monster\" to do her bidding.  The consequences of this plan end up being unexpectedly tragic, and Cecile and Raymond return to Paris, where they \"Live in Limbo\" together, going through the motions of life.  Father and Daughter end up living a lie they cannot come to terms with, either within themselves or with each other.  What makes this film work is its light, bubbly atmosphere of \"fun\" that is maintained throughout the film.  The first half of the picture could easily be seen as fluffy, contrived, pretentious.  But eventually this veneer is stripped away to reveal pain and denial of the characters--Their regret, remorse and tragedy.  Only after the film's end did I realize that this atmosphere had been created to contrast the grim reality of the subtext.  The final scene of the picture is chilling in the manner of \"The Twilight Zone\".  Additional highlights include (1) the crisp, clean, black and white cinematography of Paris; and (2) the original trailer for \"Bonjour Tristesse\", included on this DVD, that gives nothing away.Stephen C. Bird, Author of \"Hideous Exuberance\"",
    "overall": 5.0,
    "summary": "When Silly Games Become Dangerous",
    "unixReviewTime": 1300924800,
    "reviewTime": "03 24, 2011",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3IP0R4JOD4R5G",
    "asin": "0767808460",
    "reviewerName": "the masked reviewer",
    "helpful": [
      4,
      8
    ],
    "reviewText": "Some Bad Movies demand a response in the French style - every few minutes, you'll find yourself striking your hand to your forehead while shrieking, \"Alors!\" Just such a choice pastry is Otto Preminger's 1958 film version of Francoise Sagan's novel Bonjour Tristesse (which means, more or less, \"Hello, sadness\"), the filmmaker's second, and final, attempt to turn Jean Seberg into a star - they'd bombed a year before with Saint Joan. Pert, perky and as American as apple pie, Seberg was perhaps the last actress who could pass for an amoral, Parisian teen temptress whose incestuous feelings for her aging roue father - she calls him, ahem, \"darling\" - spell doom for anyone he seriously gets involved with.The beginning of this howler, set in the \"present,\" is shot--meaningfully - in black and white, the better to capture the stark ennui of Seberg's poor-little-rich-girl life. Out on the dance floor in a chic Paris boite, Seberg stares moonily into a camera and tells us in voice-over, \"I can't feel anything...it isn't the same anymore. Nothing is.\" Sure, you've guessed that Seberg will also mutter, \"Will I ever be happy again as I was at the beginning of that wonderful summer on the Riviera?\" thereby cueing a flashback - shot, meaningfully, in color - but no one could anticipate that before this occurs, starlet Juliette Greco turns up to croak out the film's fall-down-funny title tune: \"The street I walk is sadness/My house has no address/The letters that I write me/ Begin 'Bonjour, tristesse.'\"Alors!Summering sinfully in a villa with her rich daddy-o (David Niven) and his mistress-of-the-moment (Mylene Demongeot), Seberg trills dialogue like, \"Wait! Let's smell the day!\" so sunnily she seems to have traipsed in from a Gidget movie. Into this cozy triangle wanders Givenchy-clad Deborah Kerr, who, as the world's foremost fashion designer, inexplicably has marital designs on womanizing, good-for-nothing Niven. In no time, Niven's romancing Kerr (\"I've never wanted any woman the way I want you\"). Demongeot hits the road (\"I will not be treated like a wife!\") and Seberg is forced to explain to us how she feels (\"Part of me was angry, part of me was happy, all of me was excited\"), since she's utterly unable to register any emotion on her blank face.When Niven and Kerr start sleeping together, then announce they're engaged, Seberg is so jealous of Kerr - about whom she gushes, \"She looks softer, moves easier... I wish I walked the way she walks now\" - she literally jumps Geoffrey Horne, the hunky male starlet next door. Then, when Kerr reprimands her - \"You should realize such diversions can end up in a hospital!\" - Seberg goes bonkers at the notion of losing Niven and gaining a stepmother-cum-truant officer, and begins to plan Kerr's heave-ho. After sticking voodoo pins into her doll, Seberg tells us, on the soundtrack, \"I actually spent days comparing the contestants for my father,\" while she chalks up a blackboard comparison of herself and Kerr in such categories as \"Fun,\" \"Chic,\" \"Possessiveness\" and \"Flirting.\" (Tellingly, Seberg doesn't put \"Acting\" on the board.) Just in case we think she doesn't deserve to get dumped, Kerr suddenly gets prissy, denouncing Niven's alcoholic pals: \"In the end, their only memories will be of hangovers!\" Then, Seberg seduces Horne into feigning a romance with Demongeot, which - oh, don't ask - provokes Kerr into driving off a cliff into the sea.Alors!Back in the black-and-white \"present,\" Seberg confides that she and Niven \"have an unspoken agreement to never mention last summer\" -- the very deal, we'd guess, they cut after finishing this film.",
    "overall": 5.0,
    "summary": "Alors!",
    "unixReviewTime": 1186704000,
    "reviewTime": "08 10, 2007",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1MF4EG5XBUIMI",
    "asin": "0767808460",
    "reviewerName": "Yosuta",
    "helpful": [
      2,
      3
    ],
    "reviewText": "Would've been more captivating had it been the first time I'd seen this kind of movie, but it wasn't. Technical aspects held my interest -- especially the cinematography; the use of black and white for the present and color for flashbacks was effective. The performances were okay.  Jean Seberg is easy on the eyes.  Her real life story is more interesting than any of her film roles.  It's an inkblot.",
    "overall": 3.0,
    "summary": "'Whoops'",
    "unixReviewTime": 1207872000,
    "reviewTime": "04 11, 2008",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "AADJXNY9HSKJF",
    "asin": "0767808673",
    "reviewerName": "Aaron",
    "helpful": [
      2,
      4
    ],
    "reviewText": "After their #1 hit album \"Spice\" (which was also the #1 album of 1997), the Spice Girls released \"Spiceworld.\" Although it wasn't as successful as their first, I think it's better. The album starts off with the fantastic dance tune \"Spice Up Your Life\" with its infamous chorus, it's instantly recognizable. \"Stop\" is infectious and musucally, it's very well put together. \"Too Much\" is slow and sexy with great vocals by the girls. I also love \"Viva Forever\" which is a gorgeous ballad and also the closing \"The Lady Is A Vamp\" which has a 40's big-band style to it and is catchy as hell. So, even though they're long gone now, The Spice Girls left behind some classic pop. To all pop fans out there, be open-minded and give a listen. You might find that you like it!",
    "overall": 5.0,
    "summary": "A Great  And Underrated Pop Album!",
    "unixReviewTime": 1013990400,
    "reviewTime": "02 18, 2002",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A88Z0WGMK5JCP",
    "asin": "0767808673",
    "reviewerName": "A Customer",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I totally liked the movie and the songs that the Spice Girls did. Some of their songs are relaxing and others make you want to dance! this movie really had all their songs on it and it had some funny moments! Their are some other scenes in the movie with the Spice Girls like meeting aliens, dancing with a soldier director, Spice Girls delivering a baby, riding in a boat with little girls getting them into an accident, and the policeman forgiving them from speeding their spice bus just because they're famous! the movie can be a little overatting because it has a thin plot! But it is a good movie for Spice girl fans like me!Although their singing are a little off sometimes and their acting but I love them and I love their songs. Too bad Spice Girls are not around anymore!",
    "overall": 3.0,
    "summary": "SPICE UP MY LIFE!",
    "unixReviewTime": 1054166400,
    "reviewTime": "05 29, 2003",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1JUD55XV8FDWS",
    "asin": "0767808673",
    "reviewerName": "Adam",
    "helpful": [
      13,
      16
    ],
    "reviewText": "A lot of people want to say that this movie is a pathetic waste of time, and I'll admit that I used to say the same thing. But the thing was, I'd keep on watching it because it was fun to make fun of it! The movie includes cheesy lines, not perfect acting, and scenes that are plain out silly. But at the same time, it makes you have a great time just watching it. It's the guiltiest pleasure ever, just like the songs are. This movie has so many different scenes to it that are great fun watching, and some of them make you laugh out loud. Even if you want to laugh and make fun of it, you should really see it. Overall, it's fun and entertaining, and it's also worth watching.",
    "overall": 4.0,
    "summary": "fun and entertaining",
    "unixReviewTime": 1112918400,
    "reviewTime": "04 8, 2005",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2PV6GK1HV54Y9",
    "asin": "0767808673",
    "reviewerName": "ADRIENNE MILLER",
    "helpful": [
      0,
      2
    ],
    "reviewText": "Spiceworld by Spice Girls is a predictable album and after this album was released I stopped being a fan. The songs are weak and formulatic, this is the final time we hear Geri Halliwell, she left the group a year after the release of this album. Songs like Spice Up Your Life, Too Much, Viva Forever, and Stop have no flavor or edge to them, their debut album was ten times better than Spiceworld. This album is a stinker and even those euro babes knew it too.",
    "overall": 2.0,
    "summary": "Lame.",
    "unixReviewTime": 1209945600,
    "reviewTime": "05 5, 2008",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A2X9YHUOGTUBPI",
    "asin": "0767808673",
    "reviewerName": "A. Gilchrist \"Disney Collector\"",
    "helpful": [
      0,
      1
    ],
    "reviewText": "Well, I remember this being my favorite show when I was 11 or 12. Couldn't believe they have this movie on DVD so I had to buy it.  It's pretty much a joke of a movie but because I still have some love for the Spice Girls I was glad I'm able to have this for my collection.  It's one of those movies that you get a bunch of your girlfriends together and remember the hype of the Spice Girl era and have a pretty good laugh.",
    "overall": 3.0,
    "summary": "Hahaha",
    "unixReviewTime": 1229385600,
    "reviewTime": "12 16, 2008",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1G0VFQ9198IUF",
    "asin": "0767808673",
    "reviewerName": "al",
    "helpful": [
      0,
      0
    ],
    "reviewText": "some of the songs are stop, too much and do it.  i say the sound is good.  hope you like these legendary singers.",
    "overall": 5.0,
    "summary": "music of the 90's",
    "unixReviewTime": 1362182400,
    "reviewTime": "03 2, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1M8AYAL3L8ACP",
    "asin": "0767808673",
    "reviewerName": "Amanda L. Davis",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I thought their first album was annoying, but this one is so much better.  The lyrics are positive and it has some good dance beats on some of the songs.  I really do like it a lot.",
    "overall": 5.0,
    "summary": "A Great Pop Album and Better Than Their First",
    "unixReviewTime": 1278028800,
    "reviewTime": "07 2, 2010",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3AB48P74HHSLX",
    "asin": "0767808673",
    "reviewerName": "A. McLellan \"Mister. Melodic Perfectionist\"",
    "helpful": [
      3,
      3
    ],
    "reviewText": "First off I'm quite amazed, it seems EVERY other review on here is about the movie!! Well this is not the VHS, DVD or blu-ray, you have clicked on the CD version of Spiceworld, aka the very bearable soundtrack to the movie.This album is great. Listening to it makes me realise what a lost society we live in now, where barely an original tune is released anymore. Spiceworld takes me back to not only my early teen years, but back to when music was great. The melodies are superb and catchy, and the lyrics mean something worthwile. Now for my song reviews:1. Spice Up Your Life - 3/5. My least favourite track on the album, the one time I felt the girls had been pressured into a particular type of song to appeal for the first single. It's not bad, but it's not up to the Spice Girls standards.2. Stop - 4.5/5. Terrific, a lot of people's favourite track. It's upbeat, and fun, and has a terrific climax.3. Too Much - 4/5. A very sweet yet sexy sort of song that cold be construed as this album's \"2 Become 1\". Listening to it, you can just tell it's classic Britpop (what ever happened to that, btw?).4. Saturday Night Divas - 4/5. Another of those fun songs that could easily appeal to the brainless no-taste kids out there who only like music to dance to, but it also packs a very catchy original tune, and it just gels really, really well. Will get stuck in your head for days.5. Never Give Up On The Good Times - 5/5. My person favourite of all Spice Girls songs. I remember when I first heard it, I was sure I'd heard it before somewhere. Never did find out, but I guess I didn't, perhaps it's just that original that you feel like you've heard it before because it's so good.Anyway, this is a long one (clocks in at 4 and a half minutes!!) but that's because there's so much there. It starts of with frogs (yeah, frogs), and then jumps into a head-nodding beat, and then the strings come in and take over the show. As usual, Mel C's strong and unique voice is used to good effect here (Never give it up, no; never give it up, no). Can't get any better than this, if it's your sort of thing.6. Move Over - 3.5/5. Generation Next, which I sang as Generation X for about 10 years... This is another fun one that goes just that one step further so it doesn't seal its fate as another forgettable pop tune. It's probably near the bottom of the pile in terms of favourites, but it's still very good and catchy.7. Do It - 4/5. From the get-go Mel C's voice \"duetting\" with itself tells you that you're in for a great original British song (aren't we the best?). This song is about doing what you want and not caring what others think. I can't get over how such a cool, hip tune (even in today's society) is able to add genuinely touching moments in between. Quite wonderful and catchy.8. Denying - 4/5. Same as above. Hip, catchy as hell, and with touching moments. This song has just that bit more substance than the rest because it's dealing with someone who thinks they're better than everyone else.9. Viva Forever - 4/5. The prettiest song on the album, it's clearly inspired by Geri \"Ginger\" Halliwell's background. Very Spanish sounding, but with those awesome strings put to good use again, and a tune that is actually remarkably beautiful. If the music video hadn't been so stupid, I'd give it 4.5.10. The Lady Is A Tramp - 4.5/5. What fun! Scrap the past 40 years of music development and go straight back into the good old jazz/Chicago-esque style. My Dad, who's in his late 60s, loves this song. And so do I. It's just so completely unexpected from the Girls and it's original to boot. Go back in time and release this as a record single, nobody will know the difference and it'd be a hit then too. The ending is terrific and sends chills down my spine. As with every song on this album, I recommend playing it really loud on an excellent sound system.So there you go. I honestly believe every track on this album could have been a number 1 hit had they been given the chance, but the fact that the album was #1 for so long shows just how terrific the music is. I'd say this album will go down in history... just as soon as these emo people stop taking over the music world and brandishing everything as shamefully lame. I'll sit and listen to this while I wait. :)",
    "overall": 5.0,
    "summary": "For those wondering about the MUSIC, not the movie",
    "unixReviewTime": 1227398400,
    "reviewTime": "11 23, 2008",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3HU0B9XUEVHIM",
    "asin": "0767808673",
    "reviewerName": "Andre S. Grindle \"Andre' Grindle\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I really don't know if anyone expected the Spice Girls to follow up their debut so fast and so well but they did. By this time Spicemania had hit full blast. Their videos were all over the place,their were dolls of them in Toys R Us and indeed for anyone who thought of them as \"pure marketing\" during this time were certainly not being proven otherwise by the heavy hype surrounding them. Either way there was a lot to be excited about for those who stuck with them. They were about to make a feature film,a goofy self deprecating comedy to which this album served as a soundtrack and shared a title. Needless to say this album would represent a good deal of creative growth for them as they decided to up every possible ante of their debut and create an album that in turn was more musically and thematically diverse than the one that came before.This album is filled to the brim with show stoppers. Again the album is front loaded with hits,all excellent and that all emphasize the groups stylistic growth. The title track opens up the affair with a bang with a high octane salsa number where \"Stop\",one of my favorites pays homage to The Supremes with a Motown-via-Culture Club style pop/R&B; tune. \"Too Much\" is a 60's style Southern Soul ballad with a lyric that's actually sort of touching. Again their are a series of harder funk/hip-hop style numbers but this time they are a bit more aggresive such as on \"Saturday Night Divas\",\"Move Over\",\"Do It\" and \"Denying\"-all of which showcase a more genuine showcase for their \"girl power\" concept. One of the best songs here is the spirited retro disco \"Never Give Up On A Good Thing\" with an influence of Dee Lite and Jamiroquai all over it to top off on. This time the album closes with two more popular hits-the epic ballad \"Viva Forever\" and the caberet jazz styled \"The Lady Is A Vamp\",a song likely the concoction of Geri \"Ginger Spice\" Halliwell  considering her future solo direction.After this album the group would split up and everyone seemed to think that The Spice Girls had peaked too early and just exploded out of existence. Even though they would come back four years later things would never quite be the same. They seemed to have a great momentum going early on in their career and a full future ahead of them but they didn't seem to have as easy a go of it personally as...well the last huge British group to have this level of commercial success. Although because they never developed the same sort of musical adulation as the Fab Four was to their advantage because they didn't have to contend with having the musical pressures that came with that. Now one can speculate what might've happened if they'd kept up this momentum-who knows maybe they'd have developed the \"credibility\" that seemed to define even pop stars at this point in time. But things just trailed off for different personal reasons and we're left with these two albums as a reminder of when The Spice Girls ruled the world.",
    "overall": 5.0,
    "summary": "Spicing Up Your Life",
    "unixReviewTime": 1301616000,
    "reviewTime": "04 1, 2011",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2E5SIA2VXQ9TU",
    "asin": "0767808673",
    "reviewerName": "Andrew \"Andrew\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Sometime in April of last year I got this little bug in me.  I just wanted to listen to the spice girls.  I had &quot;spice&quot; by them but not &quot;spiceworld.&quot;  So I bought it.  Now I have to say that this album is such fun and so much better than most of the pop out now.  You have &quot;spice up your life&quot; and &quot;do it&quot; on here.  Both songs are dance, full of movement and just full of energy!Put this album on and you realize how much fun that time in your life actually was, how much you've changed but also how much you cna still look back on the old times and remember everything.  The spice girls ruled the world while they were around, and I didn't mind.",
    "overall": 5.0,
    "summary": "Pure pop pleasure.",
    "unixReviewTime": 1068768000,
    "reviewTime": "11 14, 2003",
    "classification": "satisfied"
  },
  {
    "reviewerID": "ANCOMAI0I7LVG",
    "asin": "0767808673",
    "reviewerName": "Andrew Ellington",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I remember when I was a teenager and The Spice Girls were huge and I was in love with Geri `Sexy Spice' Halliwell.  Yes, as a young teen (like pre-teen actually), I was infatuated with what the Spice Girls represented; strong, carefree women who were slinking and lovely to look at, and listen to.  My friends and I listened to `Spice' on repeat for months and yes, we sang along with our favorite girls (the ones we fantasized about actually having a shot with).The funny thing is that for many, The Spice Girls were a fad that they couldn't wait to watch fizzle out.  They were a joke to music snobs who thought that the gimmick was all that tied these girls to the airwaves.  Sadly, many wrote them off, but thankfully their loyal fans kept them alive (and continue to keep them relevant despite them all moving on).  Yes, The Spice Girls are the biggest selling girl group in the world, and it's actually pretty easy to understand why.  They were a phenomenon, much in the same vein as The Beetles were (seriously, I'm not joking), and while talent cannot be compared, one should not begrudge these five women the respect they've earned.On top of that, `Spice' was a really good album.With their sophomore album, The Spice Girls serves up a lot of the same things that made their debut work so well.  With Motown influences (`Stop') and funky disco beats (`Spice Up Your Life') along with the slinky sensuality (`Too Much') that made them an unstoppable force, `Spiceworld' gives us more reasons to adore these five ladies.  Sadly, the album is not as strong a collection as `Spice' was, and some of the more commercial toned tracks are truly dated, unlike the more ageless style of `Spice'.  I still think of them every time I drink a Pepsi thanks to `Move Over'.  The highlight of the album may actually be `Viva Forever', thanks to the Spanish vibe and slinky personality.No, The Spice Girls were the best group to hit the airwaves in the 90's, but they are probably the most memorable and not only because of their outlandish personalities and media obsessed celebrity.  No, if you actually take a minute to really LISTEN to their music you'll see that they were smart women who could not only sing, but they could sell what they were singing.",
    "overall": 3.0,
    "summary": "This sophomore album isn't as strong, but still serves up some smiles...",
    "unixReviewTime": 1359417600,
    "reviewTime": "01 29, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1ZHDKEASDXEV5",
    "asin": "0767808673",
    "reviewerName": "Anthony Pacifico",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Spice World, the Spice Girls, need I say more. GIRL POWER! A fun movie for anyone missing the 90's or just looking to reminice.",
    "overall": 5.0,
    "summary": "Sugar ans SPICE and everything nice",
    "unixReviewTime": 1360886400,
    "reviewTime": "02 15, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AA6KE4ZQVBVSP",
    "asin": "0767808673",
    "reviewerName": "Ashley",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I bought this for my sister for Christmas.  We loved the Spice Girls in elementary school and we had this on VHS when we taped it off the TV.  So great to have it on DVD, I just need to buy one for myself!",
    "overall": 5.0,
    "summary": "Hilarious!",
    "unixReviewTime": 1395792000,
    "reviewTime": "03 26, 2014",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A4YJASO8CIMQ8",
    "asin": "0767808673",
    "reviewerName": "Ashley \"socialite827\"",
    "helpful": [
      3,
      3
    ],
    "reviewText": "I had this movie on VHS, and lost it.  One day I had this incredibly strong urge to watch it, so I ordered it and now I watch it all the time.  It's fun to sing along to in a group.  One thing, the dance instructor isn't saying \"porta bra,\" he is actually saying \"port de bras,\" a French term for movement of the arms that is used in ballet.",
    "overall": 5.0,
    "summary": "Loves It",
    "unixReviewTime": 1169596800,
    "reviewTime": "01 24, 2007",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1L8IB1K8ETJW9",
    "asin": "0767808673",
    "reviewerName": "bgflynn",
    "helpful": [
      3,
      7
    ],
    "reviewText": "If it's not then it's got be be close to it.  This is just horrible!  There is nothing more to say about it.",
    "overall": 1.0,
    "summary": "Could this be the worst movie ever made!",
    "unixReviewTime": 996192000,
    "reviewTime": "07 27, 2001",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A19WTKWBDHVX26",
    "asin": "0767808673",
    "reviewerName": "Blackbird",
    "helpful": [
      1,
      1
    ],
    "reviewText": "If in the 90's you were into the spice girls then this is the movie to watch. To some it may be cheesy but to anyone who remember music from the 90's its a classic. I highly recommend this movie, especially if you were a spice girl fan.",
    "overall": 5.0,
    "summary": "Awesome movie! Great seller, fast shipping!",
    "unixReviewTime": 1325894400,
    "reviewTime": "01 7, 2012",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3TZLMZVP5H5J4",
    "asin": "0767808673",
    "reviewerName": "Boz",
    "helpful": [
      0,
      1
    ],
    "reviewText": "I always felt that a lot of our British cousins across the ocean were a bit too merciless in panning the S.G. as just another hack pop group who couldnt carry a tune. I got the DVD for my daughter when she was 5 and the Scary doll. One day I just put in the VHS and watched.  Yes it was silly, at times it was a kind of duh humour that you may have heard before in one way or another. But it was never dull. I enjoyed their good natured shenanigans and thought that they actually did a good job for a showcase movie.Im sorry that as a group they didnt last as long nor did their reunion concert that I attended with my then 13 year old daughter catapult them into a new vibrancy. They had the energy and the talent imho. Unfortunatley wether or not it was bad management, chemistry gone bad or just wanting family life it didnt happen.But I felt also that the GoGos also ended too soon as well. Sei La vie.",
    "overall": 5.0,
    "summary": "Actually a fun movie, lots of energy and the songs are not bad at all.",
    "unixReviewTime": 1241136000,
    "reviewTime": "05 1, 2009",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AX1R1YFOR2IKL",
    "asin": "0767808673",
    "reviewerName": "brandy",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Spice world is the best movie ever. Hands down. So Do yourself a favor and buy this. Just do it.",
    "overall": 5.0,
    "summary": "Spice of life",
    "unixReviewTime": 1388793600,
    "reviewTime": "01 4, 2014",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3IA5HIDD2XFQ7",
    "asin": "0767808673",
    "reviewerName": "Brian Davis \"Brian P. Davis\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Soon after the release of this album, Geri parted ways with the group...but I didn't care, because she was my least favorite girl, anyway! In fact, she barely sang at all...but whatever. This album, I think, was really great. The girls matured this time around, even though they were still having fun and the music was still great.",
    "overall": 5.0,
    "summary": "Definitely a Spicey world!",
    "unixReviewTime": 1034294400,
    "reviewTime": "10 11, 2002",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A141HP4LYPWMSR",
    "asin": "0767808673",
    "reviewerName": "Brian E. Erland",
    "helpful": [
      53,
      58
    ],
    "reviewText": "I could say that I bought 'Spice World' for my teenage daughter and that would be quite true. Of course that statement wouldn't account for the additional copy stashed away in my own personal DVD collection. I guess it's time for me to face up to the truth and just say it out loud. Mel B - Mel C - Victoria - Geri & Emma, your movie is hilarious!Yes, it's predictable, shallow and inane, but it's also adorable, quirky and off-the-wall in a good, Monty Python sort of way. It actually works! Say and think what you will, I LIKE IT! So no more excuses accepted, get your own copy of 'Spice World' so you can enjoy the Fab Five as they romp about jolly old England in their very 'posh' double decker bus! GIRL POWER!!",
    "overall": 4.0,
    "summary": "\"Porta-Bra Ladies, Porta-Bra\"",
    "unixReviewTime": 1143504000,
    "reviewTime": "03 28, 2006",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3804ADXG509OR",
    "asin": "0767808673",
    "reviewerName": "Brittany",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I used to love this movie when I was a kid and when I found it on DVD i was so excited!! Love this movie!! Spice Girls 'Viva Forever'! :)",
    "overall": 5.0,
    "summary": "My Childhood returns!!",
    "unixReviewTime": 1361404800,
    "reviewTime": "02 21, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3HTX1NOTTWERP",
    "asin": "0767808673",
    "reviewerName": "Busy Body",
    "helpful": [
      5,
      8
    ],
    "reviewText": "When someone mentions a certain year or decade, I instantly think about the artistic creations that were influencing me at the time. For example, when I think back to the years of 1996-1998, the Spice Girls instantly spring to mind. Before this pop phenomenon, I had no interest in music what so ever. Then I heard \"Wannabe\" one day on the radio and was hooked. The Spice Girls were brilliant, every young kid in the world was in love with them and they made me happier than I had ever been. At 10 years old, I didn't understand that they were obviously ruled by the record company and seen as total pop-puppets by anyone who wasn't a screaming teenage idoliser. Looking back, I think of how innocent the whole thing was; I had no idea of their money-making and manufactured image. All I cared about was the music...and Geri, but that's a different story. This band rocked the world - more so than Backstreet Boys, Britney Spears, Madonna, Mariah Carey and even Michael Jackson ever did. They were simply the biggest pop phenomenon since the Beatles, at least in the UK. Their run of nine UK No.1 singles in the space of just over four years and album sales exceeding 50 million with just two albums proved their popularity.The girls swept the board at the 1997 Brit Awards in which the band performed the classic Who Do You Think You Are. Geri Halliwell appeared in a Union Jack mini-dress and blew the minds of millions of teenage boys the world over. From then on, I was totally in love with the woman - yes, a guilty truth...but I wasn't the only one. The dress is simply iconic the world over and fetched more than 40,000 at auction a few years later - more than double than what Madonna's 1990 Blonde Ambition Tour conical bra fetched! The endorsement factor of the Spice Girls was also a big franchise; deals with Sony PlayStation, Walkers crisps, Pepsi, Impulse deoderant body spray, Polaroid cameras, Mercedes cars and much more netted each girl millions. A lot of this occured in 1997, but the girls also released their much-awaited second album, Spiceworld, in November of this year. Obviously, the album went to No.1 all over the world and sold almost 20 million copies - a significant drop for the almost-30 million sales of their debut album, Spice...but still a staggering amount compared to most other acts around.Spiceworld opens with the fabulous song \"Spice Up Your Life.\" The first single to be taken from this second album, the song rocketed straight to No.1 in the UK in October 1997. Even more spectacular, the song dislodged the biggest selling single in history off the No.1 spot; Elton John's Candle In The Wind. You know they're doing something right when they can achieve a feat that grand. The song itself has a fantastic cultural beat to it with a swirly jungle-boogie beat as a backdrop. The video is also brilliant and looks very expensive. They rule the world in the video, with Spice all over the place. This was a reflection on their real lives and the power and control they had over the world. \"Stop\" was the third song to be released as a single from Spiceworld and shockingly peaked at No.2 in March 1998 in the UK - their only single not to go straight to No.1 in the UK. The song has a very retro, 1960's feel to it which works wonderfully with the mood of the song. \"Too Much\" is one of the best Spice Girls ballads to date. This absolutely superb song was released in December 1997 and became the Spice Girls' sixth consecutive UK No.1. The vocals of Geri Halliwell and Melanie C are particulary outstanding on this smash hit. \"Saturday Night Divas\" is another brilliant song about the girls getting down on the town on, surprisingly, a Saturday night.\"Never Give Up On The Good Times\" is the best non-released song on Spiceworld and simply swings with funk and glamour. The addictive dance beat that starts off the song is soon replaced with a classy string arrangement and the foxy vocals of Geri Halliwell. The chorus is incredibly catchy and the percussion interlude halfway through is another highlight. Move Over is the shortest song on Spiceworld at only 2:46. The song was originally called \"Generation Next\" and featured in the girls' Pepsi TV advertisement. The blend of hardcore rock and funky dance beats work very well and make for another highlight from Spiceworld. \"Do It\" and \"Denying\" are another two superb songs. The former has a very dancey and happy feel to it, while the latter is more laid-back and relaxing with a striking R'n'B style - much better than anything on Forever. \"Viva Forever\" is just absolutely stunning - definitely one of the best ballads I've ever heard. Released in July 1998 after Geri Halliwell's legendary departure from the Spice Girls, it stormed to No.1 in the UK shifting almost 300,000 copies in its first week of release and became their seventh UK No.1 single. \"The Lady Is A Vamp\" is a good song to close this great album, but not quite as good as If U Can't Dance; the closing song from the Spice Girls' debut album, Spice.OVERALL GRADE: 10/10Along with Spice, I consider Spiceworld to be amongst the greatest pop albums you can ever buy - and definitely the best by an all-female grop in history. All this recent news of the Spice Gils getting back for a last album and world tour would be absolutely fantastic, but I just can't see it happening. I'd love for it to happen, but the way Mel C's successful solo career is going, I don't think there's any chance. Still, we can always re-live the memories of the greatest female pop group of all time by listening to their first two albums - buy Spiceworld from Amazon now!",
    "overall": 5.0,
    "summary": "Superb Follow Up To The Classic Debut",
    "unixReviewTime": 1046995200,
    "reviewTime": "03 7, 2003",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3FWU0QJVW3CSK",
    "asin": "0767808673",
    "reviewerName": "Canuckfcuk",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The second best POP album of the 90's.  The first being SPICE!  From the get go the girls are at their loud, sassy, brazen, selves with nonsense lyrics and killer choruses sure to get your butt moving.  The Spice Girls, bless em, came out at a time when the music industry was at it's miserable, self pitying, depressing, stuck up, worst and gave it the kick in the arse it desperately needed!  And with really big shoes too!The last official  POP HURRAH of the 90's--pop music after this went down hill.  Very fitting the last line in the last song \"The Lady is a Vamp\" is \"HAHAHA....thank you very much!\"",
    "overall": 5.0,
    "summary": "SPICE UP YOUR LIFE!!!!!!!!!",
    "unixReviewTime": 1078444800,
    "reviewTime": "03 5, 2004",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2FDAPXBLM1Q1I",
    "asin": "0767808673",
    "reviewerName": "Cassie Walling",
    "helpful": [
      0,
      0
    ],
    "reviewText": "when this movie came out i was seven and i remember watching it on vhs at my grandmother's house. me and my cousin loved there songs and loved the movie even more. when i moved i losted the verison i had so i had to buy it again. great for girls of any age",
    "overall": 5.0,
    "summary": "Grew up with this movie",
    "unixReviewTime": 1400889600,
    "reviewTime": "05 24, 2014",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AE42JLYPXUI45",
    "asin": "0767808673",
    "reviewerName": "Chad DeFeo \"(ChandlerBingFan)\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "In 1996, the Spice Girls saw the beginning of their fame when they released their first album, Spice, which produced the five spin-off singles, Wannabe, Say You'll Be There, 2 Become 1, Who Do You Think You Are, & Mama. Now, exactly one year after their first album's release, the girls brought us their second album, Spiceworld. The album as to coincide with their movie of the same name and was also made the soundtrack to the movie. Very much like what The Beatles did back in 1964 when they did A Hard Day's Night (both album and movie) and in 1966 when they did Help! (both album and movie).SPICE UP YOUR LIFEThe first single from the album. I first heard this on Q-102 (for those of you who don't know what Q-102 is, it is a Philadelphia FM Radio Station). But the version I heard on the radio was kind of a mix in a way and it led me to believe that it was done by a different band. When I heard this version, which is the album and single version, I was proven to be wrong about thinking it was done by somebody else. It's a classic song and consists of every girl power hype sound within it. The song means you have to have fun in life. Life is too short to be bitter, so, Spice Up Your Life.STOPThe third single from the album. The single was released in early 1998 and it was to be Geri's last single with the girls. I have heard three different reasons to why Geri departed from the band. The first is that she and Melanie B. had a serious outting. The second is that she tried to be the boss of the group and was kicked out by the other girls. The third was that Geri had musical differences. The third reason is what I believe is true and that is because it is true. Anyhow, this is a great song.TOO MUCHThe second single from the album. This is a beautiful song and the jazzy sound is unbelievable. In the video, the five have their own individual scenes, but never a scene where they are together. Geri's scene is based on the film, \"Casablanca\" (with Geri dressed in a long, white party gown, performing in a nightclub, with sea sailors around her, sort of portraying \"Casablanca\"'s female lead female character). Victoria's scene is based on Michelle Pfeiffer's characterizaion of \"Catwoman\", from the 1992 film, \"Batman Returns\" (with Victoria dressed in a black vinyl outfit, complete with a long, black ponytail). Melanie B.'s scene is based on the film, \"Mad Max\", as she is shown in an industrial, post-apocalyptic war scene. Melanie C.'s scene is based on the film, \"Year Of The Dragon\" (with Melanie C. dressed in black trousers and an Chinese-style red top, her hair is in a long pontytail with a red streak). Emma's scene is based on the 1982 horror film, \"Poltergeist\" (with Emma dressed in a white pajamas, where she is in a bedroom with toys floating around her).SATURDAY NIGHT DIVASAwesome song.NEVER GIVE UP ON THE GOOD TIMESThey should have released this as a single. It's a great song. It is like a sequel to Spice Up Your Life, (even though this one has a fun Pop-like song) where they say that you can't give up on the good times you've had.MOVE OVERIn their short time together, the girls recorded two songs for Pepsi. The first would be a song called, \"Step To Me\", which is an album cut. The second be this one right here. Although, they did not release it as a single, the girls, however, filmed a Pepsi commercial, using this song within it.DO ITNot bad.DENYINGThis one is not bad. Still holding onto their girl power sound, but the girls threw in a bit of R&B; into it.VIVA FOREVERThe fourth and final single from the album, although it is not a US single. Though, the single and video were released just before Geri's departure, the girls released the video just after Geri's departure and was the first single where they used an animated video. It is a beautiful song and I always make sure to listen to it before turning off the album.THE LADY IS A VAMPGeri was big fan of everything that had to do with entertainment from the 40s, 50s, & 60s. This song consists of a sound from the 40s, but talks about everything from the 40s, 50s, 60s, and 70s, like Elvis, Ziggy Marley, Bond Girls, Charlie's Angels, 60s model Twiggy, Jackie-O, Marilyn Monroe (but addressed by her real name, Norma Jean Baker), Sandy and Danny (from Grease), etc. The song's finale fit the song perfectly, where they call out their Spice names.Still filled with their girl power sound and remains as their second best album.",
    "overall": 5.0,
    "summary": "Spiceworld (1997)",
    "unixReviewTime": 1089849600,
    "reviewTime": "07 15, 2004",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A15JTJXQXO22JJ",
    "asin": "0767808673",
    "reviewerName": "Chad Frey",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I became a fan of this group few months before there 2nd album and the spiceworld movie came across america.There's so many great songs on this album. Start to finish there's not one dud or filler on this pop classic gem.Released in Nov. of 1997. Love'em then and still enjoying there work till this day.It would be cool if they released a 15th anniversary edition of spiceworld with all the b-sides , demos, outtakes , live cuts and a dvd of rare footage to top it all.",
    "overall": 5.0,
    "summary": "Spiceworld Ultimate Pop Classic Album",
    "unixReviewTime": 1311465600,
    "reviewTime": "07 24, 2011",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2J7B7F2J7V4DM",
    "asin": "0767808673",
    "reviewerName": "Chosroes III",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The Spice Girls, those glitter-besotted pottymouth disciples of mayhem, continued their history-making bubblegum crusade against the decadent relics of grunge on this, the second of two albums that would kick in a new pop era of bouncy, glowing optimism and divinely frivolous tunes.  But none who came after could reach the fever-pitch exhilaration they managed on song after song.  \"Spiceworld\" takes off on a euphoric trip through the archetypal pop formats-- Motown, disco, even showtunes--to create a global groove for the dancing masses of teens, tweens, kids and adults who all fell under the spell of these fiercely independent pop princesses.  \"Spice Up Your Life\" swirls with carnaval percussion and a wriggling, jungle-inspired beat; its an Oasis-like wall of sound built out of Latin rhythms and the patented Spice hooks.  \"Stop\" is their inspired Supremes homage, dizzying in its joyous recreation of that classic sound.  \"Too Much\" is the first brooding ballad, more jazzy than \"2 Become One\" but similarly lush and lovestruck-- just listen and consider how very, very far everyone else on the scene is from creating slow tunes with such mastery.  \"Saturday Night Divas\" slinks along with a dazzlingly orchestrated syncopation.  The floor-stomping \"Never Give Up On the Good Times\" represents a pinnacle of energy, even on this disc of flushed-cheek dance tunes-- this disco anthem shakes and shimmys in  ecstatic release, the explosion of positve energy that is the Spice Girls' trademark.  And on and on and on.  \"Move Over\" punkishly extends the Pepsi-commercial theme into a song on Girl Power revolution.  \"Do It\" lays down the feminist 'rules are for fools' theme, with a swooningly delicious bridge sweeter than melted ice cream (thanks especially to Emma on that one).  \"Denying\" is a sultrier sort of R&B tune, somewhat akin to the \"Forever\" album's material with its smoldering lover's anger.  On the second ballad, \"Viva Forever\", the Spice Girls express a shockingly Neo-Platonic conception of life (\"Live forever, for the moment/ Ever searching, for the one\") in dreamy lyrics that express fervent yearning,  over a swelling orchestral arrangement with touches of Spanish flavor.  Yes, and then there's the closing number, \"Lady is a Vamp\" where the Spice Girls salute their culture-heroes in a rousing, comic piece of burlesque.  Whether as solo artists or a group, we'll certainly continue to enjoy the show.  \"Spiceworld\", in each and every song, is a monument in pop history, an artifact as enduring as \"A Hard Day's Night\" or the \"Immaculate Collection\".  As writers and performers, the Spice Girls achieved new heights of energetic bliss, and \"Spiceworld\" remains a must for all who would know how great pop can be.",
    "overall": 5.0,
    "summary": "Exuberance is Beauty",
    "unixReviewTime": 1022457600,
    "reviewTime": "05 27, 2002",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A29TNAVMPYFRDF",
    "asin": "0767808673",
    "reviewerName": "Chris S. \"cscotts\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Following up their successful SPICE within just ten months of that first album,  SPICEWORLD inexplicably manages to better their debut on many levels, not the least of which is an overall better set of songs and better singing.  Is there anything here that matches the pure fun of 'Wannabe'or'Say You'll Be There'?Nope,but the ten tracks here manage to consistently outdo their predecessor on just about every other level.  'Stop' is a sterling Motown stomper, while Latin vibes are mined on 'Spice Up Your Life' and 'Viva Forever', long before Ricky or J.Lo entered the pictured.  While the creative side got overall better grades at the time of its' release, there wasn't much airplay to be had, which is a shame considering that '..Life' and 'Stop' remain two of their best.",
    "overall": 5.0,
    "summary": "Follow-up Betters Their Debut",
    "unixReviewTime": 1019692800,
    "reviewTime": "04 25, 2002",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3BVVGY9N4KSA5",
    "asin": "0767808673",
    "reviewerName": "CJ Jade",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I saw this movie when it first came out, and loved it.  I am so excited to find it here.  This movie is not meant to be taken seriously. Basically this movie is about friendship and staying true to yourself.  It is a fun movie that any fan of the Spice Girls will love.",
    "overall": 5.0,
    "summary": "A Classic",
    "unixReviewTime": 1198972800,
    "reviewTime": "12 30, 2007",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1BOC7RS4R3NFO",
    "asin": "0767808673",
    "reviewerName": "CJ...loves books :-) \"CC loves books :-)\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Great DVD The package came fast it was new not broken and a good price I couldn&#8217;t pass it up. I have a good collection good DVD&#8217;s and like to add on from time to time this was a steal and I decided to purchase it I&#8217;ve seen it before but wanted in my collection&#8230;GOOD Movie/GREAT Price!",
    "overall": 5.0,
    "summary": "Classic!",
    "unixReviewTime": 1375660800,
    "reviewTime": "08 5, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3C17DXXR8GQSF",
    "asin": "0767808673",
    "reviewerName": "CJS",
    "helpful": [
      1,
      1
    ],
    "reviewText": "On the good times.I know I'm late writing this review, but honestly, I haven't even listened to this CD in years.  Then one night I put it and and was reminded why I bought it in the first place.  After I first heard \"Never Give Up on the Good Times,\" I tracked that song down... Since I'm a big fan of funk and disco and grooves, and well..things I can just shake my booty to, this song is a winner.  I like the retro feel it delivers, and while I hardly ever listen to the OTHER songs on the CD, I will listen to \"Never Give Up...\" over and over, so for that song alone I give it a solid five.",
    "overall": 5.0,
    "summary": "Never Give Up...",
    "unixReviewTime": 989712000,
    "reviewTime": "05 13, 2001",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2W8GURWX2CGQ6",
    "asin": "0767808673",
    "reviewerName": "\"crazylil_partygurl\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Ya, the spice girls arent nearly as popular as they used to be, ok not at all, but sure ther were when they were around! And so that makes this a pretty good movie since I was a big spice girl fan. These girls are really funny here!",
    "overall": 4.0,
    "summary": "Funny! Spicey ! World!",
    "unixReviewTime": 972691200,
    "reviewTime": "10 28, 2000",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1C84DTGURRW5F",
    "asin": "0767808673",
    "reviewerName": "creativemusic",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This is just a great romp for anyone who enjoys the Spice Girls. It's silly and funny and the music is pure Spice gold.",
    "overall": 5.0,
    "summary": "A fun time",
    "unixReviewTime": 1352073600,
    "reviewTime": "11 5, 2012",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2P49WD75WHAG5",
    "asin": "0767808673",
    "reviewerName": "Daniel J. Hamlow",
    "helpful": [
      2,
      3
    ],
    "reviewText": "When a group that's the real flavour of the moment decides to make a movie, it'll either be a total success or a total flop, depending upon how universally-loved the group is.  The Beatles are hands down the most successful (Hard Day's Night, Help!) due to their immortalized status.  Others have not been so, e.g. Herman's Hermits, Bill Haley.  The Spice Girls kind of fall inbetween the two.The primary influence is probably A Hard Day's Night.  Spiceworld is, after all, a day in the life of the Girls, and includes  musical numbers, an uptight manager, and a triumphant concert number.  Needless to say, it will never stand side-by-side with the Beatles' groundbreaking classic.One credit in their favour is the scene where they parody their own personalities.  Victoria, for example, can't decide whether to wear the black Gucci dress, the black Gucci dress, or the black Gucci dress in her closet.  To which Emma successfully suggests, \"why don't you wear the black Gucci dress?\"  Emma's baby-like innocence is also parodied.  And Geri's misquote on the Pope is a parody of what John Lennon said about Jesus.They seem to have the most fun trying on different costumes in the \"Saturday Night Divas\" number.  Geri as Marilyn Monroe in The Seven Year Itch and Wonder Woman shines out in particular, as do Mel C. and Geri as Danny and Sandy from Grease, and Victoria as Honey Rider in Dr. No.  But the best is when some of them dress up as each other.There are some subplots along the way, such as a documentary team following the Girls, the Girls' very pregnant friend Nicola who pops up every now and then, and a tabloid publisher who hates the girls so much, he hatches a plot to tarnish their image.  The tensions between the girls and their uptight manager Clifford, and an American film producer (George Wendt of Cheers) who consults Clifford to discuss a movie deal involving the girls.  Their Spice Force Five idea (think Spice Girls as Charlie's Angels) is actually a good segment.There are amusing guest cameos from well-known British actors and singers, such as Richard Briers, Hugh Laurie (Wooster in Jeeves and Wooster), Stephen Fry (Jeeves in J and W), Bob Geldof, Elvis Costello, Elton John, and AbFab's Jennifer Saunders.I doubt if Roger Moore would consider this movie as his best performance, but he seems to be enjoying himself as the Girls' behind-the-scenes handler, with some really hideous lines:  \"The drummer without sticks has no backbeat.\"  Richard E. Grant though gets noteworthy mention as Clifford.  The scene of him having a real fit at seeing tabloid headlines bashing the girls is funny, but the girls laugh it off and even make fun of him, which makes him even madder.  Meat Loaf is Dennis, the Girls' loyal bus driver, and there's an in-joke when he's asked to add repairing the bus-toilet to his list of duties.  \"I love those girls.  I'll do anything for them, but I won't do that.\"  Hint:  his last hit single.The performances in this movie may depend upon which Spice Girl is your favourite.  In my case, it's Geri, Emma, and Mel C. in that order, but love or hate the movie, all the Spice Girls are still very charming and lovable.  Songs done in this movie in order:  \"Too Much\", \"Do It\", \"Say You Will Be There\", \"Mama\", \"Denying\", \"Saturday Night Divas\", \"Stop\", \"2 Become 1\", \"Leader Of The Gang\", \"Never Give Up On The Good Times\", \"My Boy Lollipop\", \"Wannabe\", \"Viva Forever\", \"Who Do You Think You Are\", \"Spice Up Your Life\", and \"The Lady Is A Vamp.\"Had I reviewed this in the throes of my Spice-induced euphoria of 1998, I would have given this the max.  Time though, has not been so generous, but at least the quintet left behind a movie showing them at their peak.",
    "overall": 3.0,
    "summary": "Spiceworld loses its flavour five years later",
    "unixReviewTime": 1057190400,
    "reviewTime": "07 3, 2003",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1USP962PG5RIR",
    "asin": "0767808673",
    "reviewerName": "DARTH KNITE",
    "helpful": [
      0,
      0
    ],
    "reviewText": "In a form of music such as Pop, where most bands are manufactured and work  as puppets to the managers and what the record lebel wants them to do,  Spice Girls give a strong form of originality that is what makes them stand  out among the rest. They write their own music and do their own thing and  that works. The second album Spiceworld really shows off their talent. The  songs have a great diversity to them and that give them and very diverse  fan base and they never make the same song twice like other bands of their  nature. This album has a great mix of songs from the great opening track  Spice up you Life , to the 40's sound of Too Much and the Lady is a Vamp,  to the incredible Ballad,  Viva Forever. This is a great album, and I'm  sure the next one, Forever, will be just as good. I've already heard the  first single, Holler, holler and It's great. All fans of the first album  will love Spiceworld. This is one group that holds up through the years.",
    "overall": 5.0,
    "summary": "Still the Best Pop group you'll find.",
    "unixReviewTime": 968112000,
    "reviewTime": "09 5, 2000",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A2B73CL3QSYWLB",
    "asin": "0767808673",
    "reviewerName": "David Baldwin",
    "helpful": [
      0,
      2
    ],
    "reviewText": "Britain, circa 1997.  Tony Blair is elected P.M.  Princess Di perishes.  And the Spice Girls are unleashed to an unsuspecting public.  This effort is an attempt to cash in on the phenomenon before a fickle populace turns their attention to the next best thing.  To be fair, the girls are not to blame for what a tedious flick this is.  Rather, they are appealing and prove to be the film's lone redeeming factor.  The fault lies in the script that tries to do for the Spice Girls what \"A Hard Days' Night\" did for the Beatles.  Whereas the Fab Four's film was full of wit and cogent commentary on Beatlemania this flick is unfunny and basically incoherent about what it's trying to say about the Spice craze.  I was reminded more of the Monkees' \"Head\" than I was of \"A Hard Days' Night\".  Lots of celeb cameos (Roger Moore, Elton John, et al) that amount to naught.  Oh, well.  On to \"From Justin to Kelly\".",
    "overall": 2.0,
    "summary": "Cruel Brittania",
    "unixReviewTime": 1171324800,
    "reviewTime": "02 13, 2007",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A22S91YEO8DJBF",
    "asin": "0767808673",
    "reviewerName": "David R. Lorenz",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The Spice Girls (the original group, back when Ginger was still a Spice Girl) at their very best!!The is a great, whacky, humorously campy look at the Spice Girls; a self-satire. The girls poke fun at themselves and the whole world of pop music!It's the Spice Girls first big concert. The girls are nervous enough as it is, without having to deal with the pitfalls of the music world; a newspaper editor who hates them; a photographer who appears from out of nowhere; and a slave-driver of a manager.Will the Spice Girls first show be a success? will they break up?A comedy full of fun, music and Spice",
    "overall": 5.0,
    "summary": "add Spice to your life!",
    "unixReviewTime": 1009929600,
    "reviewTime": "01 2, 2002",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A3VLX5Z090RQ0V",
    "asin": "0767808673",
    "reviewerName": "Del Keyes \"Elaborate Chattering Nut\"",
    "helpful": [
      0,
      2
    ],
    "reviewText": "Just because The Beatleshave done it, that doesn't mean the Spice Girls should do the same.  It's a heavy risk for music artists to sell their name on to the big screen, and believe me,this could go very wrong.  Some make it out okay with just the bio-pics, other played it safe and just make theirs a concert movie, but \"Spice World\" took a completely alternate step.  It's a Spice Girls power hour where a lot of zany antics occur, and nothing makes sense.I might be completely biased with this movie, because much like my unholy memories with Tom Green, the Spice Girls were also a devistating memory of youth; the thing is I used to like Tom Green while I was strongly indifferent with the girl band.  But for most of my middle school years, I'm surround by many fangirls in support of this group who play their music loudly and constantly, and I had to be the butt of a ongoing ridicule just because I made a simple comment that Ginger Spice was cute (and Geri Haliwell still looks pretty good).  My adolescent years was damaged because of the band, so reopening this mental wound does lead to personal spite.But there are objective things to legitimately castrate this movie.  The biggest problem with the movie is that it's aimless.  The Spice Girls were setting up for a concert, they had a convenient pregnant best friend to chat with, their agent was pushing them to work hard and not have fun, and a tabloit journalist hired a sleazy paparazzo to tarnish the band because he's bored.  Everything else is practically plotless, just random scenarios that segue into other random scenarios.  They sing in different places, they meet celebrity cameos, they go on a photo shoot, two American studio execs are pitching a Spice Girls movie out of the blue, they ride on sport boats with their contest-winning fangirls, they were in a military dance camp with a stern gestappo instructor, and they were discovered by an alien race who loved their music.  There's no connection with each of these scenarios, the randomness of the goofball situations is akin to \"Family Guy\".  It also means these situations are practically idiotic in direction, if not just wordy whenever the girls just run their months about stuff only pre-teens would get into.Just to hide the fact that the Spice Girls have no acting talent, the rest of the actors have to be completely bonkers. Their agent acts like if Ari Gold popped some speed and drank a pack of red bull, the tabloit guy is pontifically British, and the studio execs are so desperately perverse when they pitch the worst ideas ever in a film, almost like a parallel to this film; the execs even ripped-off an idea from a show pilot in \"Pulp Fiction\" (Spice Force Five, get it?). Neither of them are funny, they're just pretentious, much like the movie's gags.Again, I'm being biased.  I am not the film's audience, the audience are young impressionable girls who loved the band's songs.  This movie understood its intended audience, that's why the Spice Girls went on an S&M; club, they let their pregnant friend drink alcohol, they wear revealing outfits, an alien nearly copped a feel on Scary Spice, and their agent threatened to hang himself live in concert if the band didn't show up.  But seriously, the audience for this movie is limited at this point.  It wasn't long after the movie's release that Ginger Spice followed her own independent example and left the band, which cause the foundation to crumble and the fans had to move on.  I could say the Spice Girls are gone for good (and no, I'm not counting their world tour stunt a few years back that lasted only a week), but something life has a funny way of turning things around.  If New Kids on the Block manage to get togetherand release an album not too long ago, it's possible that this girl group would rekindle their friendship.  Regardless, this movie is a nonsensical publicity stunt.",
    "overall": 2.0,
    "summary": "Girls Gone Random",
    "unixReviewTime": 1281571200,
    "reviewTime": "08 12, 2010",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A1XPF2NKNDLDUQ",
    "asin": "0767808673",
    "reviewerName": "Denise",
    "helpful": [
      0,
      1
    ],
    "reviewText": "Spice Girls are a classic, but I wouldn't waste my money on the album again. I only liked a few songs from the album, otherwise the rest was garbage.",
    "overall": 1.0,
    "summary": "Ok",
    "unixReviewTime": 1362787200,
    "reviewTime": "03 9, 2013",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A3VGK9YUJVYWVE",
    "asin": "0767808673",
    "reviewerName": "D. Richardson \"thegirliestgirl\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I love this movie, I'm 23 and was a teen when these girls hit the airwaves, I love them, I love the movie, it's great for teen girls I think (be careful just a little adult humor), buy it!",
    "overall": 5.0,
    "summary": "Good Clean Fun",
    "unixReviewTime": 1141344000,
    "reviewTime": "03 3, 2006",
    "classification": "satisfied"
  },
  {
    "reviewerID": "AU8552YCOO5QX",
    "asin": "0767808673",
    "reviewerName": "D.W. Smith \"NA\"",
    "helpful": [
      1,
      3
    ],
    "reviewText": "If you know Lester's work, you know that he makes lousy films that are sometimes funny.  This is a lousy film which is sometimes funny.  But the girls really have no talent.  Victoria Beckham can sort of sing, but that's about it.  Not much at all really.",
    "overall": 2.0,
    "summary": "Looks like a Richard Lester film.",
    "unixReviewTime": 1217808000,
    "reviewTime": "08 4, 2008",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A3BQCZNB97XUNY",
    "asin": "0767808673",
    "reviewerName": "Eggplant \"Eyehateamazon\"",
    "helpful": [
      4,
      10
    ],
    "reviewText": "...but not enough to be able to stand this mind-numbing, annoying, ditzy, unintellegent, preposterous, discreditable throw-away of a movie that was no more than an attempt to cash in on a pointless late '90s fad. (I admit I had a crush on Baby Spice, but other that that, BLEECCCCHHHHH.)Right about when these talentless hacks became popular, I was in fifth grade, and every girl in my class (plus a couple of guys...) had to have EVERYTHING with their stupid faces on it. Me and my friends were starting to get into nu-metal like KoRn and Wimp Bizkit (hey, we were in fifth grade, give us a break), and everywhere you went, you got attacked by a bunch of prissy peabrains running around going \"GIRL POWER!!!!\" Oy vey. Well, that's okay. Thank god that these mental midgets are no longer around to sully the media any further.This garbage, along with those ever-annoying Hansons, get my vote for the worst fads of the late '90s. Both \"acts\" are illogical, dull-witted, implausible, unreasoned, muddled, stupid, cloddish, thickheaded, nettlesome, maddening, harassing, and just plain flat out a waste of some perfectly good blank DVD's/CD's. Nobody likes/cares about them anymore (no, not even the girls in my class), so now they are out of sight, and out of mind forever.But all kidding aside, what are we going to do with J. Lo??",
    "overall": 1.0,
    "summary": "I Love The '90s...",
    "unixReviewTime": 1071878400,
    "reviewTime": "12 20, 2003",
    "classification": "unsatisfied"
  },
  {
    "reviewerID": "A3I0OYO5133Z6P",
    "asin": "0767808673",
    "reviewerName": "GARRET \"garret\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "this is a prettie smashing movie. you really get to know allof the spice girls. and all their unique personalites.my favorite spice is melanie c. aka sporty spice. the onlything that botherd me is that sometimes they start showingthe discussions of their managers and things like that. itshows their reersals,disscusions,concerts and just about halfof the life of the spice girls really.its very hard to findtheir products these days becuase pepole say their out of style.anyway you should buy it its very cool and very rare!",
    "overall": 5.0,
    "summary": "scene it!",
    "unixReviewTime": 1131235200,
    "reviewTime": "11 6, 2005",
    "classification": "satisfied"
  },
  {
    "reviewerID": "ATFNT456Z3N64",
    "asin": "0767808673",
    "reviewerName": "Geno",
    "helpful": [
      1,
      2
    ],
    "reviewText": "This is such a great movie. Talk about guilty pleasure! It's one of those \"feel-good\" movies that makes you laugh any time you watch it and puts you in a happy mood. It follows the girls as they prepare for a big gig (no pun intended) at Albert Hall. The band even experiences a fictional, yet scarily ironic, break up part way through the movie. They work it out... but don't we wish that the same thing could've happened with the real-life break up. This movie makes you feel like you are with the girls and makes you wish you really were! Of course, Emma \"Baby\" Bunton steals the show with her charming good looks and always loveable personality. (P.S. Emma, feel free to visit me whenever you want! I'd love to meet you!) This is a must have for any fan of the Spice Girls or anyone who is into fun - loving movies. Also check out the Spice Girls' CDs \"Spice\" and \"Spice World\", they are awesome. But pass up \"Forever\" which lost the girls about 7 million fans here in the U.S. This is definitely a movie that I would recommend (FINALLY, I spell it right!) to anyone! You won't regret this purchase... at least rent it! Enjoy!",
    "overall": 5.0,
    "summary": "One Giant Music Video!",
    "unixReviewTime": 1044576000,
    "reviewTime": "02 7, 2003",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A7Y6AVS576M03",
    "asin": "0767808673",
    "reviewerName": "gobirds2",
    "helpful": [
      1,
      1
    ],
    "reviewText": "The auteur theory of filmmaking is alive and kicking in this cinematic vehicle for the girls. \"Auteur theory?\" you may ask. \"Yes, most definitively.\" The trend of cinema and other forms of art as a mainstream attraction and influence on everyday life have escalated to gargantuan proportions. As society becomes more \"plastic\" the perpetuators of \"plastic\" want to exponentially increase their monopolistic viewpoint and hold on the retail market and thus their hold on the individual. Many critics compared this film to \"A Hard Day's Night\" but they are sadly missing the point. \"A Hard Day's Night\" was the last film as that traversed the void from innocence into cynicism. George Harrison's scene with the advertising executive was a forerunner of thing to come as big business learns how to mold the teenage market. \"Spice\" in its entirety is about big business and the teenage market. Roger Moore seen with a pig in his lap is not doing a James Bond parody of Blofeld. Roger's character is commenting on big business and the plastic society it has created. That's no ordinary pig in his lap. That's a golden pig.",
    "overall": 5.0,
    "summary": "Spice and the Auteur",
    "unixReviewTime": 972086400,
    "reviewTime": "10 21, 2000",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A1EYUZTL1RY5CV",
    "asin": "0767808673",
    "reviewerName": "Guy Brown \"Guy\"",
    "helpful": [
      1,
      2
    ],
    "reviewText": "If you want to see a fun movie, that has your favorite music group on it, go right ahead. Because on a regular movie list, this is nothing but stupidity. But on a fun level, it is way up there. Because i'm sure the producers knew it wasn't going to be a hit. I'm sure the Spice Girls knew it wasn't going to be a hit. But in a way it was a hit, because it just looked like the type of movie where the makers had fun making it. Overall, if you just want something to eat popcorn to and have a few laughs, go right ahead.",
    "overall": 3.0,
    "summary": "Stupid, But In A Way, It Is Fun",
    "unixReviewTime": 1117065600,
    "reviewTime": "05 26, 2005",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A35BBCC3ES0V84",
    "asin": "0767808673",
    "reviewerName": "Heather M. Pond \"CHTMcougarette09\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "You really had to have grown up in the 90's to understand the awesomeness of this movie.  I mean what young girl in the 90's didn't love the Spice Girls?  They were all unique and they had such great success with what they did which not many girl groups can say!",
    "overall": 5.0,
    "summary": "90's Kid",
    "unixReviewTime": 1374969600,
    "reviewTime": "07 28, 2013",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A20JYIHL1W1U54",
    "asin": "0767808673",
    "reviewerName": "hille2000 \"hille2000\"",
    "helpful": [
      0,
      2
    ],
    "reviewText": "It was good to see Roger Mooer James Bond 007 in a film again. This time he plays a character who looks very much like Blofeld. Instead of a cat he now keeps a pig in his lap. Very cool idea! As with David Lean's \"Doctor Zhivago\" it is about a few years in the turbulent life of the all-female Anglo-Soviet assembly. The Spy and Spice Girls have plenty of character, and that helps make up for the lack of action and adventure that keeps their movie debut from being a truly epic motion picture. The concert scene at Albert Hall in London was very reminiscent of Hitchcock's \"The Man Who Knew Too Much.\" It was kind of a 90's version on some of his themes as well as David Lean's and the Bond producers.  However, it has a potential of being cult epic like \"Austin Powers.\"",
    "overall": 5.0,
    "summary": "ALL SPICE",
    "unixReviewTime": 971913600,
    "reviewTime": "10 19, 2000",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A12RCVRE3T6L8Y",
    "asin": "0767808673",
    "reviewerName": "H TERESA K",
    "helpful": [
      1,
      3
    ],
    "reviewText": "It was good to see Roger Moore, no longer James Bond 007, in a film again. This time he plays a character that looks very much like his nemesis Blofeld. Instead of a cat he now keeps a pig in his lap. Very cool idea! As with David Lean's DOCTOR ZHIVAGO it is about a few years in the turbulent life of the all-female Anglo-Soviet assembly. The Spy and Spice Girls have plenty of character, and that helps make up for the lack of action and adventure that keeps their movie debut from being a truly epic motion picture. The concert scene at Albert Hall in London was very reminiscent of Hitchcock's THE MAN WHO KNEW TOO MUCH. It was kind of a 90's version on some of his themes as well as David Lean's and those of the Bond producers. However, it has a potential of being cult epic like AUSTIN POWERS. Perhaps not. Perhaps time will be kind to these spicy gals.",
    "overall": 4.0,
    "summary": "Live and Let Spice",
    "unixReviewTime": 1159315200,
    "reviewTime": "09 27, 2006",
    "classification": "satisfied"
  },
  {
    "reviewerID": "A35XFZN4MWNKK4",
    "asin": "0767808673",
    "reviewerName": "ianphillips@uk.dreamcast.com",
    "helpful": [
      6,
      12
    ],
    "reviewText": "The Spice Girls have proved all critics wrong and although individually their vocals are thin and lack range and power, they have made some instantly memroable recordings and likewise their solo releases have been fairly good too given to prove that you don't really seem to have to have much singing power these days. This film is little more than extended concert footage with silly and painfully unfunny sequences linked to them. None of the girls could act their way out of a wet paper bag but i'm sure they don't care as they certainly made lots of money from this. Fans will be delighted whilst others will just gauge at how dross like this can be made and earn big money.",
    "overall": 1.0,
    "summary": "FORGETABLE DROSS",
    "unixReviewTime": 975801600,
    "reviewTime": "12 3, 2000",
    "classification": "unsatisfied"
  },{
    "reviewerID": "A329PQ0WJOIZL5",
    "asin": "0767808673",
    "reviewerName": "jdealy999",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Although the 5 members of the all-girl group the Spice Girls have parted ways over 17 years ago (not counting the short time reunion in 2007 for a greatest hits record), the 2 albums still sound as fresh as ever whenever I listen to them.My favorite Spice Girl in particular is Melanie C. (&#34;Sporty&#34; Spice) because her voice stands out above the rest.  Check out her soaring and soulful harmonies on &#34;Say You'll Be There&#34;, &#34;Too Much&#34;, &#34;Never Give Up On The Good Times&#34;, &#34;Stop&#34;, and &#34;Do It.&#34;The Spice Girls quickly captured the world's attention with their bright harmonies, fun/playful lyrics, great dance/pop hooks, and excellent balladry after &#34;Wannabe&#34; completely exploded in the U.K. and the U.S.  (oh yes, I do want to &#34;zig-a-zig, AH!!) Considering the songs on each record, my personal favorites are &#34;2 Become 1&#34; (I love Victoria's vocals on the song), &#34;Love Thing&#34;, &#34;Mama&#34; (another great vocal by Emma &#34;Baby Spice&#34; Bunton), &#34;Something Kinda Funny&#34;, &#34;Saturday Night Divas&#34; (great, sexy, moody tempo on this song), and &#34;Viva Forever.&#34;Geri &#34;Ginger Spice&#34; Halliwell sadly left in 1998, leaving the other 4 members to pick up where they left off.  They released a paltry album, 2000's &#34;Forever&#34;.  However, it didn't even top the charts -- apparently because of Geri's lingering absence.  But that changed in 2007 when they reunited for the &#34;Greatest Hits&#34; LP with 2 brand new tracks -- which features &#34;Voodoo&#34; and &#34;Friendship Never Ends.&#34;Truly, a band/group is as unbreakable as their bonds or friendship to one another.  Victoria married soccer mega-star David Beckham, Geri released 3 solo records and had a daughter (Madonna Blue??), Emma released 3 solo records of her own, and Melanie B. recently became a host on &#34;America's Got Talent.&#34;  And I stated above, Melanie C. stood out the strongest, having SIX albums to her credit and being very diverse along the way.  Have you listened to 2012's &#34;Stages&#34;, people?!  You might be surprised and blown away by her talents!!I strongly recommend that you stream or purchase the Spice Girls &#34;Spice&#34; and &#34;Spiceworld&#34; and rediscover what made them so awesome in the first place.  :)",
    "overall": 5.0,
    "summary": "\"So tell me what you want, what you really, REALLY want!!\"  :)",
    "unixReviewTime": 1404604800,
    "reviewTime": "07 6, 2014",
    "classification": "satisfied"
  }
]
